mentatpsi/Microchip/USB/Precompiled Demos/PIC18F97J94 PIM Family/Firmware/main.c
} HOST_CMD_TYPE;


typedef enum LCD_DISPLAY_STATE
{
    LCD_DISPLAY_BANNER0     = 0,
    LCD_DISPLAY_BANNER1     = 1,
    LCD_DISPLAY_BANNER2     = 2,
    LCD_DISPLAY_DATE        = 3,
    LCD_DISPLAY_TIME        = 4,
    LCD_DISPLAY_SPLASH      = 5,

} LCD_DISPLAY_STATE;


typedef enum DISPLAY_DELAY_TYPE
{                                       // TMR0 ticks about every 131 mS
    DISPLAY_TIME_DELAY      = 0xFE,     // ~33 seconds = 131 mS * 0xFE
    DISPLAY_DATE_DELAY      = 0x40,     // ~ 8 seconds = 131 mS * 0x40
    DISPLAY_SPLASH_DELAY    = 0x20,     // ~ 4 seconds = 131 mS * 0x20

} DISPLAY_DELAY_TYPE;



/** VARIABLES ******************************************************/
#if defined(__18CXX)
#pragma udata

#pragma udata USB_VARS
#endif
unsigned char ReceivedDataBuffer[64];
unsigned char ToSendDataBuffer[64];

#if defined(__18CXX)
#pragma udata
#endif

USB_HANDLE USBOutHandle = 0;  //Needs to be initialized to 0 at startup.
USB_HANDLE USBInHandle = 0;   //Needs to be initialized to 0 at startup.
BOOL blinkStatusValid = TRUE;

//The LUN variable definition is critical to the MSD function driver.  This
//  array is a structure of function pointers that are the functions that 
//  will take care of each of the physical media.  For each additional LUN
//  that is added to the system, an entry into this array needs to be added
//  so that the stack can know where to find the physical layer functions.
//  In this example the media initialization function is named 
//  "MediaInitialize", the read capacity function is named "ReadCapacity",
//  etc.  
LUN_FUNCTIONS LUN[MAX_LUN + 1] = 
{
    {
        &MDD_IntFlash_MediaInitialize,
        &MDD_IntFlash_ReadCapacity,
        &MDD_IntFlash_ReadSectorSize,
        &MDD_IntFlash_MediaDetect,
        &MDD_IntFlash_SectorRead,
        &MDD_IntFlash_WriteProtectState,
        &MDD_IntFlash_SectorWrite
    }
};

/* Standard Response to INQUIRY command stored in ROM 	*/
const ROM InquiryResponse inq_resp = {
	0x00,		// peripheral device is connected, direct access block device
	0x80,           // removable
	0x04,	 	// version = 00=> does not conform to any standard, 4=> SPC-2
	0x02,		// response is in format specified by SPC-2
	0x20,		// n-4 = 36-4=32= 0x20
	0x00,		// sccs etc.
	0x00,		// bque=1 and cmdque=0,indicates simple queueing 00 is obsolete,
			// but as in case of other device, we are just using 00
	0x00,		// 00 obsolete, 0x80 for basic task queueing
	{'M','i','c','r','o','c','h','p'
    },
	// this is the T10 assigned Vendor ID
	{'M','a','s','s',' ','S','t','o','r','a','g','e',' ',' ',' ',' '
    },
	{'0','0','0','1'
    }
};

/* Global value for RTCC time*/
DTVALUE RTCC_DTV;
// Global LCD variables
LCD_DISPLAY_STATE LCDState      = 0x00;
volatile BOOL PeriodicRefresh   = FALSE;
BYTE LCDRefreshCount            = 0x00;
BOOL LCDDisplayRTCC             = TRUE;

#if defined(PIC18F97J94_PIM)
    #define MCU_NAME    "PIC18F97J94 "
#elif defined(PIC18F87J94_PIM)
    #define MCU_NAME    "PIC18F87J94 "
#else // MCU Type unknown
    #error "device unknown: Check device configuration"
#endif // PIC18F97J94

BANRSTR Banr[LCDMAXBANR];
const ROM BANRSTR BanrPGM[LCDMAXBANR] = {
	{"      Presenting the " MCU_NAME,              0, 0, FALSE},   // 0
	{"      With USB,LCD,EMB,VBAT and More!!! ",    0, 0, FALSE},   // 1
	{"      Your Text Here ",                       0, 0, FALSE},   // 2
	};


/** PRIVATE PROTOTYPES *********************************************/
static void InitializeSystem(void);
void USBDeviceTasks(void);
void ProcessIO(void);
void YourHighPriorityISRCode(void);
void YourLowPriorityISRCode(void);
void USBCBSendResume(void);
void UserInit(void);
WORD_VAL ReadPOT(void);
void BlinkUSBStatus(void);

/** VECTOR REMAPPING ***********************************************/
#if defined(__18CXX)
	//On PIC18 devices, addresses 0x00, 0x08, and 0x18 are used for
	//the reset, high priority interrupt, and low priority interrupt
	//vectors.  However, the current Microchip USB bootloader 
	//examples are intended to occupy addresses 0x00-0x7FF or
	//0x00-0xFFF depending on which bootloader is used.  Therefore,
	//the bootloader code remaps these vectors to new locations
	//as indicated below.  This remapping is only necessary if you
	//wish to program the hex file generated from this project with
	//the USB bootloader.  If no bootloader is used, edit the
	//usb_config.h file and comment out the following defines:
	//#define PROGRAMMABLE_WITH_USB_HID_BOOTLOADER
	//#define PROGRAMMABLE_WITH_USB_LEGACY_CUSTOM_CLASS_BOOTLOADER
	
	#if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)
		#define REMAPPED_RESET_VECTOR_ADDRESS			0x1000
		#define REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS	0x1008
		#define REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS	0x1018
	#elif defined(PROGRAMMABLE_WITH_USB_MCHPUSB_BOOTLOADER)	
		#define REMAPPED_RESET_VECTOR_ADDRESS			0x800
		#define REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS	0x808
		#define REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS	0x818
	#else	
		#define REMAPPED_RESET_VECTOR_ADDRESS			0x00
		#define REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS	0x08
		#define REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS	0x18
	#endif
	
	#if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)||defined(PROGRAMMABLE_WITH_USB_MCHPUSB_BOOTLOADER)
	extern void _startup (void);        // See c018i.c in your C18 compiler dir
	#pragma code REMAPPED_RESET_VECTOR = REMAPPED_RESET_VECTOR_ADDRESS
	void _reset (void)
	{
	    _asm goto _startup _endasm
	}
	#endif
	#pragma code REMAPPED_HIGH_INTERRUPT_VECTOR = REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS
	void Remapped_High_ISR (void)
	{
	     _asm goto YourHighPriorityISRCode _endasm
	}
	#pragma code REMAPPED_LOW_INTERRUPT_VECTOR = REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS
	void Remapped_Low_ISR (void)
	{
	     _asm goto YourLowPriorityISRCode _endasm
	}
	
	#if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)||defined(PROGRAMMABLE_WITH_USB_MCHPUSB_BOOTLOADER)
	//Note: If this project is built while one of the bootloaders has
	//been defined, but then the output hex file is not programmed with
	//the bootloader, addresses 0x08 and 0x18 would end up programmed with 0xFFFF.
	//As a result, if an actual interrupt was enabled and occured, the PC would jump
	//to 0x08 (or 0x18) and would begin executing "0xFFFF" (unprogrammed space).  This
	//executes as nop instructions, but the PC would eventually reach the REMAPPED_RESET_VECTOR_ADDRESS
	//(0x1000 or 0x800, depending upon bootloader), and would execute the "goto _startup".  This
	//would effective reset the application.
	
	//To fix this situation, we should always deliberately place a 
	//"goto REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS" at address 0x08, and a
	//"goto REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS" at address 0x18.  When the output
	//hex file of this project is programmed with the bootloader, these sections do not
	//get bootloaded (as they overlap the bootloader space).  If the output hex file is not
	//programmed using the bootloader, then the below goto instructions do get programmed,
	//and the hex file still works like normal.  The below section is only required to fix this
	//scenario.
	#pragma code HIGH_INTERRUPT_VECTOR = 0x08
	void High_ISR (void)
	{
	     _asm goto REMAPPED_HIGH_INTERRUPT_VECTOR_ADDRESS _endasm
	}
	#pragma code LOW_INTERRUPT_VECTOR = 0x18
	void Low_ISR (void)
	{
	     _asm goto REMAPPED_LOW_INTERRUPT_VECTOR_ADDRESS _endasm
	}
	#endif	//end of "#if defined(PROGRAMMABLE_WITH_USB_HID_BOOTLOADER)||defined(PROGRAMMABLE_WITH_USB_LEGACY_CUSTOM_CLASS_BOOTLOADER)"

	#pragma code
	
	
