mentatpsi/Microchip/USB/Precompiled Demos/PIC18F97J94 PIM Family/Firmware/main.c
	//These are your actual interrupt handling routines.
	#pragma interrupt YourHighPriorityISRCode
	void YourHighPriorityISRCode()
	{
		//Check which interrupt flag caused the interrupt.
		//Service the interrupt
		//Clear the interrupt flag
		//Etc.
        #if defined(USB_INTERRUPT)
	        USBDeviceTasks();
        #endif
	
	}	//This return will be a "retfie fast", since this is in a #pragma interrupt section 
	#pragma interruptlow YourLowPriorityISRCode
	void YourLowPriorityISRCode()
	{
		//Check which interrupt flag caused the interrupt.
		//Service the interrupt
		//Clear the interrupt flag
		//Etc.
		if(INTCONbits.TMR0IF)
		{
			PeriodicRefresh = TRUE;
			INTCONbits.TMR0IF = 0;
		}	
			
	}	//This return will be a "retfie", since this is in a #pragma interruptlow section 
#endif




/** DECLARATIONS ***************************************************/
#if defined(__18CXX)
    #pragma code
#endif

/********************************************************************
 * Function:        void main(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 
 *
 * Side Effects:    None
 *
 * Overview:        Main program entry point.
 *
 * Note:            None
 *******************************************************************/
#if defined(__18CXX)
void main(void)
#else
int main(void)
#endif
{   
	//Check for failed state
	unsigned char a = 0xA9;
	unsigned char b = 0x56;
	
	if(a == 0x56)
	{
		mInitAllLEDs();         // TRISHbits.TRISH2 = 0;
		                        // TRISHbits.TRISH3 = 0;
		mLED_1_On();            // LATHbits.LATH2 = 1;
		mLED_2_On();            // LATHbits.LATH3 = 1;
		Reset();
		while(1);
	}	
	
    InitializeSystem();

    LCDSetAll();

    #if defined(USB_INTERRUPT)
        USBDeviceAttach();
    #endif

    while(1)
    {
        #if defined(USB_POLLING)
		// Check bus status and service USB interrupts.
        USBDeviceTasks(); // Interrupt or polling method.  If using polling, must call
        				  // this function periodically.  This function will take care
        				  // of processing and responding to SETUP transactions 
        				  // (such as during the enumeration process when you first
        				  // plug in).  USB hosts require that USB devices should accept
        				  // and process SETUP packets in a timely fashion.  Therefore,
        				  // when using polling, this function should be called 
        				  // regularly (such as once every 1.8ms or faster** [see 
        				  // inline code comments in usb_device.c for explanation when
        				  // "or faster" applies])  In most cases, the USBDeviceTasks() 
        				  // function does not take very long to execute (ex: <100 
        				  // instruction cycles) before it returns.
        #endif
    				  

		// Application-specific tasks.
		// Application related code may be added here, or in the ProcessIO() function.
        ProcessIO();
        if(PeriodicRefresh)
        {  
	        PeriodicRefresh = FALSE;
	        
        	Get_RTCC_Value(&RTCC_DTV);
	        
	        //*************************************//
	        // LCD Banner Update States            //
	        //*************************************//
	        if(LCDState < LCD_DISPLAY_DATE)
	        {
		        if(Banr[LCDState].ScrlCmplt == TRUE)
				{
					Banr[LCDState].ScrlCmplt = FALSE;
					LCDState++;
					if((LCDDisplayRTCC == FALSE) && (LCDState > 2))
	        		{
		        		LCDState = LCD_DISPLAY_BANNER0;	
		        	}
				}
                else
                {
                    UpdateBanner(&Banr[LCDState]);
                }
	        }
	        
	        //*************************************//
	        // LCD Date Update State               //
	        //*************************************//
	        if(LCDState == LCD_DISPLAY_DATE)
	        {

                DisplayDate( &RTCC_DTV );
		        LCDRefreshCount++;
		        if(LCDRefreshCount > DISPLAY_DATE_DELAY)
		        {
			        LCDState++;
			        LCDRefreshCount = 0;
			    } 
		    }
		    
		    //*************************************//
	        // LCD Time Update State               //
	        //*************************************//
		    if(LCDState == LCD_DISPLAY_TIME)
		    {
		        
                DisplayTime( &RTCC_DTV );
			    LCDRefreshCount++;
			    if(LCDRefreshCount > DISPLAY_TIME_DELAY)
		        {
			        LCDState = LCD_DISPLAY_BANNER0;
			        LCDRefreshCount = 0;
			    } 
			} 
			
			//*************************************//
	        // LCD Initial Splash Screen           //
	        //*************************************//
			if(LCDState == LCD_DISPLAY_SPLASH)
			{

                DisplaySplash();
				LCDRefreshCount++;
			    if(LCDRefreshCount > DISPLAY_SPLASH_DELAY)
		        {
			        LCDState = LCD_DISPLAY_BANNER0;
			        LCDRefreshCount = 0;
			    } 
			}	

        } // if( PeriodicRefresh )

    }//end while

}//end main


/********************************************************************
 * Function:        static void InitializeSystem(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        InitializeSystem is a centralize initialization
 *                  routine. All required USB initialization routines
 *                  are called from here.
 *
 *                  User application initialization routine should
 *                  also be called from here.                  
 *
 * Note:            None
 *******************************************************************/
static void InitializeSystem(void)
{
    #if (defined(__18CXX) & !defined(PIC18F87J50_PIM) & !defined(PIC18F97J94_FAMILY))
        ADCON1 |= 0x0F;                 // Default all pins to digital
    #elif defined(__C30__) || defined __XC16__
    	#if defined(__PIC24FJ256DA210__) || defined(__PIC24FJ256GB210__)
    		ANSA = 0x0000;
    		ANSB = 0x0000;
    		ANSC = 0x0000;
    		ANSD = 0x0000;
    		ANSE = 0x0000;
    		ANSF = 0x0000;
    		ANSG = 0x0000;
     #elif defined(__dsPIC33EP512MU810__) || defined (__PIC24EP512GU810__)
        	ANSELA = 0x0000;
    		ANSELB = 0x0000;
    		ANSELC = 0x0000;
    		ANSELD = 0x0000;
    		ANSELE = 0x0000;
    		ANSELG = 0x0000;
            
            // The dsPIC33EP512MU810 features Peripheral Pin
            // select. The following statements map UART2 to 
            // device pins which would connect to the the 
            // RX232 transciever on the Explorer 16 board.

