mentatpsi/Microchip/USB/Precompiled Demos/PIC18F97J94 PIM Family/Firmware/main.c
    ACLKCON3 = 0x24C1;   
    ACLKDIV3 = 0x7;
   
    ACLKCON3bits.ENAPLL = 1;
    while(ACLKCON3bits.APLLCK != 1); 

#endif

    //	The USB specifications require that USB peripheral devices must never source
    //	current onto the Vbus pin.  Additionally, USB peripherals should not source
    //	current on D+ or D- when the host/hub is not actively powering the Vbus line.
    //	When designing a self powered (as opposed to bus powered) USB peripheral
    //	device, the firmware should make sure not to turn on the USB module and D+
    //	or D- pull up resistor unless Vbus is actively powered.  Therefore, the
    //	firmware needs some means to detect when Vbus is being powered by the host.
    //	A 5V tolerant I/O pin can be connected to Vbus (through a resistor), and
    // 	can be used to detect when Vbus is high (host actively powering), or low
    //	(host is shut down or otherwise not supplying power).  The USB firmware
    // 	can then periodically poll this I/O pin to know when it is okay to turn on
    //	the USB module/D+/D- pull up resistor.  When designing a purely bus powered
    //	peripheral device, it is not possible to source current on D+ or D- when the
    //	host is not actively providing power on Vbus. Therefore, implementing this
    //	bus sense feature is optional.  This firmware can be made to use this bus
    //	sense feature by making sure "USE_USB_BUS_SENSE_IO" has been defined in the
    //	HardwareProfile.h file.    
#if defined(USE_USB_BUS_SENSE_IO)
    tris_usb_bus_sense = INPUT_PIN; // See HardwareProfile.h
#endif

    //	If the host PC sends a GetStatus (device) request, the firmware must respond
    //	and let the host know if the USB peripheral device is currently bus powered
    //	or self powered.  See chapter 9 in the official USB specifications for details
    //	regarding this request.  If the peripheral device is capable of being both
    //	self and bus powered, it should not return a hard coded value for this request.
    //	Instead, firmware should check if it is currently self or bus powered, and
    //	respond accordingly.  If the hardware has been configured like demonstrated
    //	on the PICDEM FS USB Demo Board, an I/O pin can be polled to determine the
    //	currently selected power source.  On the PICDEM FS USB Demo Board, "RA2" 
    //	is used for	this purpose.  If using this feature, make sure "USE_SELF_POWER_SENSE_IO"
    //	has been defined in HardwareProfile.h, and that an appropriate I/O pin has been mapped
    //	to it in HardwareProfile.h.
#if defined(USE_SELF_POWER_SENSE_IO)
    tris_self_power = INPUT_PIN;	// See HardwareProfile.h
#endif

    UserInit();

    USBDeviceInit();	//usb_device.c.  Initializes USB module SFRs and firmware
                        //variables to known states.

}//end InitializeSystem

/******************************************************************************
 * Function:        void UserInit(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This routine should take care of all of the demo code
 *                  initialization that is required.
 *
 * Note:            
 *
 *****************************************************************************/
void UserInit(void)
{
	DTVALUE InitialDTV;
	
    //Initialize all of the LED pins
    mInitAllLEDs();
    
    //Initialize all of the push buttons
    mInitAllSwitches();
    
    //initialize the variable holding the handle for the last
    // transmission
    USBOutHandle = 0;
    USBInHandle = 0;

    blinkStatusValid = TRUE;
    
    // Must Copy the Default strings from flash into RAM for LCD Banner update
	strcpypgm2ram(&Banr[0].String[0],&BanrPGM[0].String[0]);
	Banr[0].CharStrtPt = 0;
	Banr[0].ColStrtPt = 0;
	Banr[0].ScrlCmplt = FALSE;
	strcpypgm2ram(&Banr[1].String[0],&BanrPGM[1].String[0]);
	Banr[1].CharStrtPt = 0;
	Banr[1].ColStrtPt = 0;
	Banr[1].ScrlCmplt = FALSE;
	strcpypgm2ram(&Banr[2].String[0],&BanrPGM[2].String[0]);
	Banr[2].CharStrtPt = 0;
	Banr[2].ColStrtPt = 0;
	Banr[2].ScrlCmplt = FALSE;
	
	// Initialize the LCD Refresh Variables
    LCDState = LCD_DISPLAY_SPLASH;  // State 5 displays an initial splash screen
    LCDRefreshCount = 0;    // Counts of time in a single 
    LCDDisplayRTCC = TRUE;  // Sets flag for displaying the RTCC value on the LCD or not

    LCDInit();              // Initializes the LCD driver

	
    PeriodicRefresh = FALSE; // refresh flag set by timer 0 to control banner scroll rate
    
    // Initialize Timer 0 for LCD Banner scroll refresh functions
    T0CON               = 0;        // clear T0CON
    T0CONbits.T0PS      = 4;        // Prescale 1:32
    T0CONbits.PSA       = 0;        // TMR0 input comes from prescalar output
    T0CONbits.T0CS      = 1;        // clock source (Fosc/4)
    T0CONbits.T08BIT    = 0;        // TMR0 is a 16-bit timer
    TMR0H               = 0x00;     // initial value 0x0000
    TMR0L               = 0x00;
                                    // TMR0 period = 1/(Fosc/4/32/0xFFFF)
                                    // Fosc = 64MHz
                                    // TMR0 period = ~131 mS

    T0CONbits.TMR0ON    = 1;        // turnon TMR0
    
    // Enable low priority Timer 0 interrupt to allow LCD refreshes.
    INTCON2bits.TMR0IP = 0;
    INTCONbits.TMR0IF = 0;
    INTCONbits.TMR0IE = 1;
    INTCONbits.GIEL = 1;
    
    // Is this a true POR?
    // If not Vbat is retaining RTCC we shouldn't update its value
    if(RCON3bits.VBPOR)
    {
	    //Initalize and start the RTCC
	    OSCCON2bits.SOSCGO = 1;
	    RTCC_DTV.Year   = 0x12;
	    RTCC_DTV.Month  = 0x01;
	    RTCC_DTV.Day    = 0x01;
	    RTCC_DTV.DOW    = 0x00;
	    RTCC_DTV.Hour   = 0x00;
	    RTCC_DTV.Minute = 0x00;
	    RTCC_DTV.Second = 0x00;
	    RTCC_Init(&RTCC_DTV, RTCCSOSC);
	    /*WARNING! - if using the PIC18F97J94 PIM hardware RTCC could be 
	    off due to segment pins located near SOSCO or SOSCI. User 
	    applications should avoid placement of any toggling pins near 
	    SOSCO or SOSCI in final designs to achieve most accurate RTCC 
	    performance.*/
	}
    
    // Update reset flags so we can detect a true POR
    RCON3bits.VBPOR = 0;
    RCON3bits.VBAT = 0;
}//end UserInit

