mentatpsi/Microchip/USB/Precompiled Demos/PIC18F97J94 PIM Family/Firmware/main.c
/********************************************************************
 * Function:        void ProcessIO(void)
 *
 * PreCondition:    None
 *
 * Input:           None
 *
 * Output:          None
 *
 * Side Effects:    None
 *
 * Overview:        This function is a place holder for other user
 *                  routines. It is a mixture of both USB and
 *                  non-USB tasks.
 *
 * Note:            None
 *******************************************************************/
void ProcessIO(void)
{   
	BYTE i;
	WORD_VAL w;
    unsigned char   USB_Command;


    //Blink the LEDs according to the USB device status
    if(blinkStatusValid)
    {
        BlinkUSBStatus();
    }

    // User Application USB tasks
    if((USBDeviceState < CONFIGURED_STATE)||(USBSuspendControl==1)) return;

    if(!HIDRxHandleBusy(USBOutHandle))
    {   
        USB_Command         = ReceivedDataBuffer[0];
        ToSendDataBuffer[0] = USB_Command;      // prepare to echo back to the host the command we are fulfilling in the first byte.

        switch(USB_Command)
        {
	        case USB_Rx_READ_POT:	//Read POT command.  Uses ADC to measure an analog voltage on one of the ANxx I/O pins, and returns the result to the host

               //WORD_VAL w;
                   
                   //Check to make sure the endpoint/buffer is free before we modify the contents
                if(!HIDTxHandleBusy(USBInHandle))
                {
                    mInitPOT();
                    w = ReadPOT();					//Use ADC to read the I/O pin voltage.  See the relevant HardwareProfile - xxxxx.h file for the I/O pin that it will measure.
													//Some demo boards, like the PIC18F87J50 FS USB Plug-In Module board, do not have a potentiometer (when used stand alone).
													//This function call will still measure the analog voltage on the I/O pin however.  To make the demo more interesting, it
													//is suggested that an external adjustable analog voltage should be applied to this pin.

					ToSendDataBuffer[1] = w.v[0];  	//Measured analog voltage LSB
					ToSendDataBuffer[2] = w.v[1];  	//Measured analog voltage MSB

                       //Prepare the USB module to send the data packet to the host
                    USBInHandle = HIDTxPacket(HID_EP,(BYTE*)&ToSendDataBuffer[0],64);
                }
                break;  

            case USB_Rx_SET_RTCC:  //Set RTCC Value from PC GUI to PIC

		        RTCC_DTV.Year = ReceivedDataBuffer[1];
		        RTCC_DTV.Month = ReceivedDataBuffer[2];
		        RTCC_DTV.Day = ReceivedDataBuffer[3];
		        RTCC_DTV.DOW = ReceivedDataBuffer[4];
		        RTCC_DTV.Hour = ReceivedDataBuffer[5];
		        RTCC_DTV.Minute = ReceivedDataBuffer[6];
		        RTCC_DTV.Second = ReceivedDataBuffer[7];
		        Set_RTCC_Value(&RTCC_DTV);
		        break;

            case USB_Rx_GET_RTCC:  //Get RTCC Value from PIC to the PC GUI

		        //Check to make sure the endpoint/buffer is free before we modify the contents
                if(!HIDTxHandleBusy(USBInHandle))
                {
					ToSendDataBuffer[1] = RTCC_DTV.Year;   //
					ToSendDataBuffer[2] = RTCC_DTV.Month;  //
					ToSendDataBuffer[3] = RTCC_DTV.Day;    //
					ToSendDataBuffer[4] = RTCC_DTV.DOW;    //
					ToSendDataBuffer[5] = RTCC_DTV.Hour;   //
					ToSendDataBuffer[6] = RTCC_DTV.Minute; //
					ToSendDataBuffer[7] = RTCC_DTV.Second; //	
                    //Prepare the USB module to send the data packet to the host
                    USBInHandle = HIDTxPacket(HID_EP,(BYTE*)&ToSendDataBuffer[0],64);
                }  
	       		break; 

            case USB_Rx_LCD_SPECIALS:  //Toggle LCD Special Pixels

		        LCDToggleSpecialPixels();
                break;

            case USB_Rx_LCD_SET_BANNER:  //Set LCD Custom Banner from PC GUI to PIC

            	// If we're already in the middle of another scrolling banner
            	// clear the scroll count then switch to the users custom input.
            	if(LCDState < LCD_DISPLAY_BANNER2)
            	{
            		Banr[LCDState].CharStrtPt = 0;
            		Banr[LCDState].ColStrtPt = 0;
            		Banr[LCDState].ScrlCmplt = FALSE;
            	}
            	// Switch to displaying the users input state	
            	LCDState = LCD_DISPLAY_BANNER2;
            	
            	// Copy PC GUI input to local RAM string
		        for(i=0;(i<(BANRSTRMAX-SCRLOFFSET)&&ReceivedDataBuffer[i+1]);i++)
		        {
			        Banr[2].String[i+SCRLOFFSET] = ReceivedDataBuffer[i+1];
			    } 
			    // Null terminate string
			    for(i=i;i<(BANRSTRMAX-SCRLOFFSET);i++)
			    {
				    Banr[2].String[i+SCRLOFFSET] = 0x00;
				}
                break;

            case USB_Rx_LCD_DISPLAY_RTCC:  //Set Display RTCC on LCD

		        LCDDisplayRTCC = ReceivedDataBuffer[1];
                break;    


            case USB_Rx_LED_TOGGLE:  //Toggle LEDs

		        blinkStatusValid = FALSE;
		        if(mGetLED_1() == mGetLED_2())
                {
                    mLED_1_Toggle();
                    mLED_2_Toggle();
                }
                else
                {
                    if(mGetLED_1())
                    {
                        mLED_2_On();
                    }
                    else
                    {
                        mLED_2_Off();
                    }
                }
                break;

            case USB_Rx_GET_BUTTON:  //Get push button state

                //First check to make sure the endpoint is available before modifying the data buffer contents
                if(!HIDTxHandleBusy(USBInHandle))
                {
                    //Prepare a response packet to send to the host
    				if(sw2 == 1)                            //pushbutton not pressed, pull up resistor on circuit board is pulling the PORT pin high
    				{
    					ToSendDataBuffer[1] = 0x01;			
    				}
    				else									//sw2 must be == 0, pushbutton is pressed and overpowering the pull up resistor
    				{
    					ToSendDataBuffer[1] = 0x00;
    				}
    				//Prepare the USB module to send the data packet to the host
                    USBInHandle = HIDTxPacket(HID_EP,(BYTE*)&ToSendDataBuffer[0],64);
                }

                break;  
        }
        //Re-arm the OUT endpoint, so we can receive the next OUT data packet 
        //that the host may try to send us.
        USBOutHandle = HIDRxPacket(HID_EP, (BYTE*)&ReceivedDataBuffer, 64);
    }
    MSDTasks(); 

}//end ProcessIO



